{
  "key": "Criterio de Conformidad 4.1.1",
  "name": "Procesamiento",
  "slug": "procesamiento",
  "level": "Nivel A",
  "comment": "",
  "description": "<p class='objective'><strong>En los contenidos implementados mediante el uso de lenguajes de marcado: los elementos tienen las etiquetas de apertura y cierre completas; los elementos están anidados de acuerdo con sus especificaciones; los elementos no contienen atributos duplicados y los ID son únicos</strong>, excepto cuando las especificaciones permitan estas características.</p><p><em>Nota</em>: Las etiquetas de apertura y cierre a las que les falte un carácter crítico para su formación, como un signo de 'mayor qué', o en las que falten las comillas de apertura o cierre en el valor de un atributo, no se consideran completas.</p><p>La intención de este criterio es garantizar que los agentes de usuario, incluidas las tecnologías de asistencia, puedan interpretar y analizar el contenido con precisión. En los lenguajes de marcado, los errores en la sintaxis de elementos y atributos y la falta de proporcionar etiquetas de inicio/fin anidadas correctamente conducen a errores que impiden que los agentes de usuario analicen el contenido de manera confiable.</p><p>Algunos agentes de usuario utilizan 'técnicas de reparación' para generar contenido mal codificado. Dado que las técnicas de reparación varían entre los agentes de usuario, los autores no pueden asumir que el contenido se analizará con precisión en una estructura de datos o que los agentes de usuario especializados lo procesarán correctamente.</p><p><em>Nota</em>: con la excepción de un criterio de éxito (<a href='/normas-de-accesibilidad-web/perceptible/distinguible#cambiar-tamaño-del-texto'>1.4.4 Cambiar el tamaño del texto</a> menciona específicamente que el efecto especificado por el criterio de éxito debe lograrse sin depender de una tecnología de asistencia), <strong>los autores pueden cumplir los criterios de éxito con contenido que asume el uso de una tecnología de asistencia</strong> por parte del usuario, donde tales tecnologías de asistencia.</p><p>El <a href='http://validator.w3.org/'>servicio de validación de marcado W3C</a> del World Wide Web Consortium le permite validar archivos HTML y XHTML por URI, carga de archivos y entrada directa de documentos HTML o XHTML completos.</p>"
}
