{
  "key": "Criterio de Conformidad 4.1.2",
  "name": "Nombre, función, valor",
  "slug": "nombre-funcion-valor",
  "level": "Nivel A",
  "comment": "",
  "description": "<p class='objective'><strong>Para todos los componentes de la interfaz de usuario</strong> (incluyendo pero no limitado a elementos de formulario, enlaces y componentes generados por scripts), <strong>el nombre y la función pueden ser determinados por software; los estados, propiedades y valores que pueden ser asignados por el usuario pueden ser especificados por software; y los cambios en estos elementos se encuentran disponibles para su consulta por las aplicaciones de usuario, incluyendo las ayudas técnicas.</strong></p><p><em>Nota</em>: Este criterio de conformidad se dirige principalmente a los autores web que desarrollan o programan sus propios componentes de interfaz de usuario. <strong>Los controles estándar de HTML satisfacen automáticamente este criterio cuando se emplean de acuerdo con su especificación.</strong></p><p>La intención de este criterio es garantizar que las Tecnologías de asistencia puedan recopilar información, activar y manipular el estado de los controles de la interfaz de usuario en el contenido.</p><p>Cuando se utilizan controles estándar de tecnologías accesibles, este proceso es sencillo. Si los elementos de la interfaz de usuario se utilizan de acuerdo con las especificaciones, se cumplirán las condiciones de este criterio.</p><p>Sin embargo, si se crean controles personalizados o se programan elementos de la interfaz para que tengan un rol y/o función diferente a la habitual, se deben tomar medidas adicionales para garantizar que los controles brinden información importante a las tecnologías de asistencia y permitir que los controlen las tecnologías de asistencia.</p><p>Un estado particularmente importante de un control de interfaz de usuario es si tiene foco o no. El estado de enfoque de un control se puede determinar mediante programación y las notificaciones sobre el cambio de enfoque se envían a los agentes de usuario y la tecnología de asistencia. También si se ha seleccionado o no una casilla de verificación o un botón de radio, o si un árbol contraíble o un nodo de lista están expandidos o contraídos.</p>"
}
