{
  "key": "Criterio de Conformidad 1.1.1",
  "name": "Contenido no textual",
  "slug": "contenido-no-textual",
  "level": "Nivel A",
  "comment": "",
  "description": "<p class='objective'><strong>Todo contenido no textual que se presenta al usuario tiene una alternativa textual que cumple el mismo propósito.</strong></p><p>Se exceptúa esta regla en las siguientes situaciones:</p><ol><li><strong>Controles o Entrada de datos</strong>Si el contenido no textual es un control o acepta datos introducidos por el usuario, entonces tiene un nombre que describe su propósito. Por ejemplo, imágenes utilizadas como botones de envío, mapas de imágenes o animaciones complejas. La <a href='#'>Pauta 4.1</a> detalla los requisitos adicionales sobre los controles y el contenido que aceptan entrada de datos.</li><li><strong>Contenido multimedia tempodependiente</strong>: Si el contenido no textual es una presentación multimedia con desarrollo temporal, entonces las alternativas textuales proporcionan al menos una identificación descriptiva del contenido no textual, para que los usuarios sepan qué es cuando lo encuentran en y que puedan decidir qué acción quieren tomar con él. La <a href='#'>Pauta 1.2</a> detalla los requisitos adicionales sobre contenido multimedia.</li><li><strong>Pruebas</strong>: Si el contenido no textual es una prueba o un ejercicio que no sería válido si se presentara en forma de texto, entonces las alternativas textuales proporcionan al menos una identificación descriptiva del contenido no textual. Por ejemplo, una prueba de audición no sería válida si se proporcionara una alternativa de texto. Un ejercicio de desarrollo de habilidades visuales tampoco tendría sentido en forma de texto.</li><li><strong>Sensorial</strong>: Si el contenido no textual tiene como objetivo principal el crear una experiencia sensorial específica, entonces las alternativas textuales proporcionan al menos una identificación descriptiva del contenido no textual. Por ejemplo, una interpretación sinfónica, u obras de arte visual.</li><li><strong>CAPTCHA</strong>: Si el propósito del contenido no textual es confirmar que quien está accediendo al contenido es una persona y no una computadora, entonces se proporcionan alternativas textuales que identifican y describen el propósito del contenido no textual y se proporcionan formas alternativas de Captcha con modos de salida para distintos tipos de percepciones sensoriales, con el fin de acomodarse a las diferentes discapacidades. Hay que destacar que las tecnologías Captcha son ampliamente utilizadas y presentan muchas dificultades de resolución para personas con ciertas discapacidades. Se recomienda tener en cuenta este problema y anticiparse a él, por ejemplo, proporcionando dos modalidades de Captcha o evitando su validación a usuarios autorizados.</li><li><strong>Decoración, Formato, Invisible</strong>: Si el contenido no textual es simple decoración, se utiliza únicamente para definir el formato visual, o no se presenta a los usuarios, entonces se implementa de forma que pueda ser ignorado por las ayudas técnicas. Poner texto alternativo en dichos elementos solo distrae a las personas que usan lectores de pantalla. Sin embargo, no marcar el contenido de ninguna manera deja a los usuarios adivinando cuál es el contenido que no es de texto y qué información pueden haberse perdido (aunque en realidad no se hayan perdido nada).</li></ol><p><strong>Para el contenido que no es de texto que no está cubierto por ninguna de las situaciones anteriores</strong>, como gráficos, diagramas, grabaciones de audio, imágenes y animaciones, las alternativas de texto pueden hacer que la misma información esté disponible en una forma que se pueda representar a través de cualquier modalidad: visual, auditiva o táctil. Aquí se tratan los archivos pregrabados de solo audio y solo de video, los archivos de solo audio en vivo y solo video en vivo se tratan como contenido multimedia tempo dependiente.</p>"
}
