{
  "key": "Criterio de Conformidad 1.1.1",
  "name": "Contenido no textual",
  "level": "Nivel A",
  "comment": "",
  "description": "<p>Todo contenido no textual que se presenta al usuario tiene una alternativa textual que cumple el mismo propósito, excepto en las situaciones enumeradas a continuación.</p><ol><li><strong>Controles o Entrada de datos</strong>: si el contenido no textual es un control o acepta datos introducidos por el usuario debe tener un nombre que describe su propósito.</li><li><strong>Contenido multimedia tempodependiente</strong>: Si el contenido no textual es una presentación multimedia con desarrollo temporal, entonces las alternativas textuales proporcionan al menos una identificación descriptiva del contenido no textual.</li><li><strong>Pruebas</strong>: Si el contenido no textual es una prueba o un ejercicio que no sería válido si se presentara en forma de texto, entonces las alternativas textuales proporcionan al menos una identificación descriptiva del contenido no textual.</li><li><strong>Sensorial</strong>: Si el contenido no textual tiene como objetivo principal el crear una experiencia sensorial específica, entonces las alternativas textuales proporcionan al menos una identificación descriptiva del contenido no textual.</li><li><strong>CAPTCHA</strong>: Si el propósito del contenido no textual es confirmar que quien está accediendo al contenido es una persona y no una computadora, entonces se proporcionan alternativas textuales que identifican y describen el propósito del contenido no textual y se proporcionan formas alternativas de CAPTCHA con modos de salida para distintos tipos de percepciones sensoriales, con el fin de acomodarse a las diferentes discapacidades.</li><li><strong>Decoración, Formato, Invisible</strong>: Si el contenido no textual es simple decoración, se utiliza únicamente para definir el formato visual o no se presenta a los usuarios, entonces se implementa de forma que pueda ser ignorado por las ayudas técnicas.</li></ol>",
  "img": "principles/perceptible/texto-alternativo.png",
  "caption": "La información contenida en un texto electrónico puede ser presentada en la forma que mejor se adapte a las necesidades del usuario."
}
