{
  "key": "Criterio de Conformidad 1.4.10",
  "name": "Reflujo",
  "slug": "reflujo",
  "level": "Nivel AA",
  "comment": "(Agregado en WCAG 2.1)",
  "description": "<div class='objective'><p><strong>El contenido se puede presentar sin pérdida de información o funcionalidad, y sin necesidad de desplazarse en dos dimensiones</strong> para:</p><ul><li>Contenido de desplazamiento vertical con un ancho equivalente a 320 píxeles.</li><li>Desplazamiento horizontal del contenido a una altura equivalente a 256 píxeles.</li></ul></div><p> Excepto el contenido que requiere un diseño bidimensional para su uso o significado.</p><p>La intención de este criterio es ayudar a las personas con baja visión que necesitan ampliar el texto y leerlo en una sola columna. Cuando se usa el zoom del navegador para escalar el contenido al 400% este se redistribuye, es decir, se presenta en una columna para que no sea necesario desplazarse en más de una dirección. Esto permite la percepción de los caracteres y el seguimiento, incluido el ir desde el final de una línea al principio de la siguiente. El valor de 320 píxeles es un tamaño mínimo razonable en los dispositivos móviles, y equivale a una ventana de ordenador de 1280px ampliada con zoom al 400%.</p><p>Es importante evitar la necesidad de desplazarse en la dirección de lectura para revelar las líneas que están cortadas por la ventana gráfica, porque dicho desplazamiento aumenta significativamente el esfuerzo necesario para leer. También es importante que el contenido no se oculte fuera de la pantalla. Por ejemplo, hacer zoom en una página que se desplaza verticalmente no debería hacer que el contenido se oculte a un lado.</p><p>Favorecer el reflujo también se conoce como ‘Diseño web receptivo’, o responsive. Resumidamente, esta técnica se basa en alterar la disposición de los elementos de una página web en base al ancho de pantalla disponible, permitiendo el desplazamiento en un único sentido y sin pérdida de información.</p><p>La cantidad de contenido visible puede cambiar en diferentes escalas. Por ejemplo, los menús de navegación que son completamente visibles en el diseño del escritorio a menudo se contraen en menos elementos, o incluso en un solo botón de menú: el patrón de icono de 'hamburguesa', para que ocupen menos espacio en la pantalla.</p><p><strong>El criterio se cumple siempre que todo el contenido y la funcionalidad sigan estando completamente disponibles, ya sea directamente, o revelados a través de controles accesibles.</strong></p><p>El contenido que requiere un diseño bidimensional para su uso o significado no puede volver a fluir sin perder significado y, por lo tanto, está fuera del alcance de este criterio. Por ejemplo, las tablas de datos tienen una relación bidimensional entre los encabezados y las celdas de datos. Esta relación es fundamental para transmitir el contenido. Por lo tanto, este criterio no se aplica a tablas de datos completas, y es aceptable proporcionar desplazamiento bidimensional para ellas.</p><p>La mayoría de los navegadores de los sistemas operativos móviles no combinan el reflujo y el zoom de la misma manera que en los navegadores de escritorio. Estos navegadores móviles normalmente admiten el reflujo cuando se cambia la orientación del dispositivo: el contenido se ajustará al nuevo ancho de la ventana gráfica. Sin embargo, al aplicar un zoom e implica un desplazamiento bidimensional independientemente de lo que haga el autor de la página, por lo que puede considerarse un problema de soporte del agente de usuario.</p>"
}
