{
  "key": "Criterio de Conformidad 1.4.8",
  "name": "Presentación visual",
  "slug": "presentacion-visual",
  "level": "Nivel AAA",
  "comment": "",
  "description": "<div class='objective'><p><strong>En la presentación visual de bloques de texto, se proporciona algún mecanismo para lograr lo siguiente:</strong></p><ol><li>El usuario puede seleccionar los colores de primer plano y de fondo.</li><li>El ancho no supera los 80 caracteres o glifos.</li><li>El texto no está justificado (alineado a los márgenes izquierdo y derecho).</li><li>El espacio entre líneas (interlineado) es de, al menos, un espacio y medio dentro de los párrafos y el espacio entre párrafos es, al menos, 1.5 veces mayor que el espacio entre líneas.</li><li>El texto se puede cambiar de tamaño sin tecnología de asistencia hasta en un 200 por ciento de una manera que no requiere un desplazamiento horizontal para leer una línea de texto en una ventana a pantalla completa.</li></ol></div><p>La intención de este criterio es garantizar que el texto se presente de tal manera que pueda percibirse sin que su diseño interfiera con su legibilidad. Las personas con algunas discapacidades cognitivas, del lenguaje y del aprendizaje y algunos usuarios con baja visión, no pueden percibir el texto y/o pierden su posición de lectura si el texto les resulta difícil de leer.</p><p>Algunas personas con discapacidad visual o cognitiva necesitan cambiar los colores de texto y de fondo para realizar una lectura cómoda. Otras tienen problemas para mantenerse en su posición de lectura y seguir el flujo del texto dentro de los párrafos. Tener un bloque de texto angosto les facilita continuar a la siguiente línea en un bloque.</p>",
  "examples": [
    {
      "title": "Las siguientes imágenes muestran ejemplos de texto a espacio simple, espacio y medio y doble espacio en un párrafo.",
      "description": "<div class='text-center'><img src='http://www.w3.org/TR/2016/NOTE-UNDERSTANDING-WCAG20-20161007/images/single-space.gif' alt='Ejemplo de texto a espacio simple.  (sin espacio entre cada línea de texto)'><img src='http://www.w3.org/TR/2016/NOTE-UNDERSTANDING-WCAG20-20161007/images/space-and-a-half.gif' alt='Ejemplo de texto a espacio y medio.  (un espacio igual a la mitad de la altura de una línea de texto)'><img src='http://www.w3.org/TR/2016/NOTE-UNDERSTANDING-WCAG20-20161007/images/double-space.gif' alt='Ejemplo de texto a doble espacio.  (un espacio igual a la altura de una línea de texto entre cada línea)'></div>"
    }
  ]
}
