{
  "key": "Criterio de Conformidad 1.4.3",
  "name": "Contraste (mínimo)",
  "slug": "contraste-minimo",
  "level": "Nivel AA",
  "comment": "",
  "description": "<p class='objective'><strong>La presentación visual de texto e imágenes de texto tiene una relación de contraste de al menos 4,5:1, o de 3:1 en el caso de ser un texto grande (definido a partir de 14 pt y negrita, o mayor de 18 pt).</strong></p><p>Se exceptúan los siguientes casos donde no se aplica este requisito de contraste:</p><ul><li><strong>Textos secundarios</strong>: texto o imágenes de texto que forman parte de un componente de interfaz de usuario inactivo, que son pura decoración, que no son visibles para nadie o que forman parte de una imagen que contiene otro contenido visual significativo.</li><li><strong>Logotipos</strong>: El texto que forma parte de un logotipo o imagen de marca.</li></ul><p>La intención de este criterio es proporcionar suficiente contraste entre el texto y su fondo para que pueda ser leído por personas con una visión moderadamente baja (que no utilizan tecnología de asistencia para mejorar el contraste). El contraste se calcula de forma que el color no sea un factor clave para que las personas con déficit de visión cromática, y, por lo tanto, tengan un contraste de color adecuado entre el texto y el fondo.</p><p>El texto de 18 puntos o el texto en negrita de 14 puntos se considera lo suficientemente grande y tiene trazos de caracteres más anchos, siendo más fácil de leer con un contraste más bajo, por lo tanto, el requisito de contraste es menor. Se excluye el texto que es decorativo y no transmite información.</p><p>Este criterio se aplica a todo el texto de la página, incluido el texto de marcador de posición y el texto que se muestra cuando un puntero se desplaza sobre un objeto o cuando un objeto tiene el foco del teclado.</p><p>Estos requisitos se aplican también a imágenes de texto, es decir, aquel texto que se ha convertido a píxeles y se presenta en un formato de imagen, pretendiendo que la imagen se entienda como texto con el fin de obtener un aspecto particular, diferenciándose así de imágenes que contienen texto.</p><p>Prueba en <a href='/simulacion-interactiva'>esta página</a> la herramienta de contraste de color.</p>",
  "imgs": "",
  "caption": ""
}
