{
  "key": "Criterio de Conformidad 1.4.13",
  "name": "Contenido en Hover o Focus",
  "slug": "contenido-en-hover",
  "level": "Nivel AA",
  "comment": "(Agregado en WCAG 2.1)",
  "description": "<div class='objective'><p><strong>Cuando un objeto recibe o pierde el puntero o el foco del teclado y este ha desencadenado un contenido adicional, se cumple:</strong></p><ul><li><strong>Descartable</strong>: hay un mecanismo disponible para descartar el contenido adicional sin mover el puntero o el foco del teclado, a menos que el contenido adicional comunique un error de entrada o no oscurezca o reemplace otro contenido.</li><li><strong>Hoverable</strong>: si el puntero puede activar el contenido adicional, entonces el puntero se puede mover sobre el contenido adicional sin que desaparezca el contenido adicional.</li><li><strong>Persistente</strong>: el contenido adicional permanece visible hasta que se elimina el disparador de enfoque, el usuario lo descarta o su información ya no es válida.</li></ul></div><p><strong>Excepción: la presentación visual del contenido adicional que está controlada por el agente de usuario y no es modificada por el autor, por ejemplo, el atributo title, y los cuadros de dialogo que se muestran en modales.</strong></p><p>El contenido adicional que aparece y desaparece con el enfoque del teclado o el desplazamiento del puntero a menudo genera problemas de accesibilidad, ya que es posible que el usuario no haya tenido la intención de desencadenar la interacción, o el usuario no sabe que ha aparecido nuevo contenido, o el nuevo contenido interfiere con la capacidad del usuario para realizar una tarea.</p><p>El contenido que se puede activar mediante el desplazamiento del puntero también debería poder activarse mediante el enfoque del teclado. Ver el criterio <a href='/normas-de-accesibilidad-web/operable/'>2.1.1 Teclado</a>.</p><p><strong>La intención de este criterio de éxito es garantizar que los usuarios puedan percibir el contenido adicional y hacer que aparezca y desaparezca sin interrumpir su experiencia en la página. Si se elige hacer que aparezca y desaparezca contenido adicional en coordinación con el cursor y el enfoque del teclado, este criterio de éxito especifica tres condiciones que deben cumplirse: descartable, flotante y persistente.</strong></p><h3 class='fw-extrabold line-after mt-3 fs-4'>Descartable</h3><p>La intención de esta condición es garantizar que el contenido adicional no interfiera con la visualización u operación del contenido original de la página. Se pueden utilizar dos métodos para satisfacer esta condición y evitar interferencias:</p><ul><li>Coloque el contenido adicional de modo que no oculte ningún otro contenido, incluido el activador, con la excepción de los espacios en blanco y el contenido puramente decorativo, como un gráfico de fondo que no proporciona información.</li><li>Proporcione un mecanismo para descartar fácilmente el contenido adicional, como presionando Escape.</li></ul><p>Para la mayoría de los disparadores de tamaño relativamente pequeño, es deseable implementar ambos métodos. El criterio de éxito permite que los mensajes de error de entrada persistan ya que hay casos que requieren atención o confirmación explícita.</p><h3 class='fw-extrabold line-after mt-3 fs-4'>Hoverable</h3><p>La intención de esta condición es garantizar que el contenido adicional que puede aparecer al pasar el cursor sobre un disparador, también se pueda pasar el cursor el nuevo contenido por sí mismo. El contenido que aparece al pasar el cursor puede ser difícil o imposible de percibir si se requiere que el usuario mantenga el puntero sobre el disparador.</p><h3 class='fw-extrabold line-after mt-3 fs-4'>Persistente</h3><p>La intención de esta condición es garantizar que los usuarios tengan el tiempo adecuado para percibir el contenido adicional después de que sea visible. Los usuarios con discapacidades pueden requerir más tiempo por muchas razones, como cambiar la ampliación, mover el puntero o simplemente traer el nuevo contenido a su campo visual. Una vez que aparece, el contenido debe permanecer visible hasta que:</p><ul><li>El usuario quita el cursor o el foco del disparador y el contenido adicional, de acuerdo con la experiencia típica del usuario.</li><li>El usuario descarta el contenido adicional a través del mecanismo provisto para cumplir con la condición Descartable.</li><li>La información transmitida por el contenido adicional deja de ser válida, como un mensaje de ‘ocupado’ que ya no es válido.</li></ul>",
  "imgs": "",
  "caption": ""
}
