{
  "key": "Criterio de Conformidad 1.4.12",
  "name": "Espaciado de texto",
  "slug": "espaciado-de-texto",
  "level": "Nivel AA",
  "comment": "(Agregado en WCAG 2.1)",
  "description": "<p class='objective'><strong>En el contenido de texto implementado mediante lenguaje de marcado, que admiten las siguientes propiedades de estilo de texto, no se produce ninguna pérdida de contenido o funcionalidad al configurar todo lo siguiente y no cambiar ninguna otra propiedad de estilo: </strong></p><ul><li>Altura de línea (interlineado) al menos 1,5 veces el tamaño de fuente.</li><li>Espaciar los párrafos al menos 2 veces el tamaño de la fuente.</li><li>Espaciado entre letras de al menos 0,12 veces el tamaño de la fuente.</li><li>Espaciado entre palabras de al menos 0,16 veces el tamaño de la fuente.</li></ul><p>Excepción: los lenguajes humanos y las escrituras que no utilizan una o más de estas propiedades de estilo de texto en el texto escrito pueden conformarse usando solo las propiedades que existen para esa combinación de lenguaje y escritura.</p><p>La intención de este criterio es garantizar que, cuando las personas anulan el espaciado de texto especificado por el autor para mejorar su experiencia de lectura, el contenido sigue siendo legible y operable. Cada uno de los requisitos estipulados en los cuatro puntos anteriores ayuda a garantizar que el usuario pueda adaptar el estilo del texto para satisfacer sus necesidades.</p><p>Este criterio se enfoca en la adaptabilidad del contenido a un aumento en el espacio entre líneas, palabras, letras y párrafos. Cualquier combinación de estos puede ayudar a un usuario a leer el texto de manera efectiva. Además, garantizar que el contenido se adapte correctamente cuando los usuarios anulan la configuración del autor para el espaciado también aumenta significativamente la probabilidad de que el usuario pueda establecer otras preferencias de estilo. Por ejemplo, un usuario puede necesitar cambiar a una familia de fuentes más amplia que la establecida por el autor para poder leer el texto de manera efectiva.</p><p>Este criterio no dicta que los autores deban ajustar el texto a las características detalladas ni tampoco a la implementación de un mecanismo para permitir que los usuarios lo realicen. Este criterio no se aplica a PDF, ya que no se implementan con lenguaje de marcado. Tampoco se aplica a los subtítulos incrustados dentro de un video o a imágenes de texto.</p>",
  "img": "principles/perceptible/spacing_overlap_fail.png",
  "caption": "Las últimas tres palabras de la primera frase se superponen con la segunda, lo que las convierte en ocultas e ilegibles."
}
