{
  "key": "Criterio de Conformidad 2.5.1",
  "name": "Gestos de puntero",
  "slug": "gestos-de-puntero",
  "level": "Nivel A",
  "comment": "(Agregado en WCAG 2.1)",
  "description": "<p class='objective'><strong>Toda la funcionalidad que utiliza gestos multipunto o basados en rutas para la operación se puede operar con un solo puntero sin un gesto basado en rutas, a menos que sea esencial un gesto multipunto o basado en rutas.</strong></p><p><em>Nota</em>: Este requisito se aplica al contenido web que interpreta las acciones del puntero (es decir, esto no se aplica a las acciones que se requieren para operar el agente de usuario o la tecnología de asistencia).</p><p>La intención de este criterio es garantizar que el contenido se pueda controlar con una variedad de dispositivos de señalización, habilidades y tecnologías de asistencia. Algunas personas no pueden realizar gestos de manera precisa, o pueden usar un dispositivo de entrada especializado o adaptado. Algunos métodos de señalización carecen de la capacidad o la precisión para realizar gestos multipunto o basados en rutas.</p><p><strong>Un gesto basado en ruta</strong> implica una interacción en la que no solo importan los puntos finales. Si pasar por un punto intermedio (generalmente cerca del inicio del gesto) también afecta su significado, entonces es un gesto basado en una ruta. El usuario engancha un puntero (punto de partida), realiza un movimiento que pasa por al menos un punto intermedio antes de soltar el puntero (punto final). Los ejemplos de gestos basados en rutas incluyen deslizamiento, controles deslizantes y carruseles que dependen de la dirección de la interacción, y otros gestos que trazan una ruta prescrita, como dibujar una forma específica. Dichas rutas se pueden dibujar con un dedo o un lápiz óptico en una pantalla táctil, una tableta gráfica o un trackpad, o con un ratón, joystick o dispositivo de puntero similar.</p><p><strong>Los gestos multipunto</strong> incluyen casos como: un zoom de pellizco con dos dedos, un toque dividido donde un dedo descansa en la pantalla y un segundo dedo toca, o un toque o deslizamiento con dos o tres dedos. A los usuarios les puede resultar difícil o imposible lograrlos si escriben y señalan con un solo dedo o palo.</p><p><strong>Las operaciones con un solo puntero</strong> incluyen tocar y hacer clic, tocar dos veces y hacer doble clic, presionar prolongadamente, deslizar, arrastrar. Este Criterio de Conformidad no requiere que toda la funcionalidad esté disponible a través de dispositivos de puntero, pero si está disponible para dispositivos de puntero, entonces no debería requerir gestos basados en rutas.</p><p><strong>Arrastrar</strong> es un movimiento en el que el usuario toma un objeto con un puntero (como el cursor del ratón o un dedo) y lo mueve a otra posición. Este movimiento desde el punto de inicio hasta el punto final no requiere que el usuario siga ningún camino o dirección en particular. Por lo tanto, el arrastre no se basa en la ruta y no está cubierto por este criterio de conformidad. Los movimientos de arrastre se tratan en el Criterio de Conformidad 2.5.7: Arrastrar, que estará disponible en WCAG 2.2.</p><p>Se hace una excepción para la funcionalidad que se basa inherente y necesariamente en rutas complejas o gestos multipunto. Por ejemplo, ingresar su firma puede estar inherentemente basado en una ruta.</p><p>Los autores deben asegurarse de que su contenido se pueda operar sin gestos multipunto o basados en rutas. Se pueden usar gestos multipunto o basados en rutas siempre que la funcionalidad también se pueda operar con otro método, como tocar, hacer clic, tocar dos veces, hacer doble clic, mantener presionado o hacer clic y mantener presionado.</p>",
  "img": "principles/operable/path-based-gesture.png",
  "caption": "Un gesto basado en ruta implica iniciar un movimiento de puntero que pasa por al menos un punto intermedio antes del punto final. El punto final puede ser una continuación o permitir varios movimientos.",
  "examples": [
    {
      "title": "Ampliación en un mapa.",
      "description": "<p>Un sitio web incluye una vista de mapa que admite el gesto de pellizcar para hacer zoom en el contenido del mapa. Los controles de la interfaz de usuario ofrecen la operación usando botones más y menos para acercar y alejar.</p>"
    },
    {
      "title": "Carrusel de imágenes.",
      "description": "<p>Un sitio tiene un control deslizante de contenido horizontal con imágenes que se pueden mover horizontalmente con un deslizamiento/movimiento rápido a izquierda o derecha. También se ofrecen botones de flecha hacia adelante y hacia atrás para la activación del movimiento.</p>"
    }
  ]
}
