{
  "key": "Criterio de Conformidad 2.5.2",
  "name": "Cancelación de puntero",
  "slug": "cancelacion-de-puntero",
  "level": "Nivel A",
  "comment": "(Agregado en WCAG 2.1)",
  "description": "<div class='objective'><p><strong>Para la funcionalidad que se puede operar usando un solo puntero, al menos uno de los siguientes es verdadero:</strong></p><ul><li><strong>Sin evento descendente (Down-Event)</strong>: el evento descendente del puntero 'touchstart' o 'mousedown' no se utiliza para ejecutar ninguna parte de la función.</li><li><strong>Abortar o Deshacer</strong>: La finalización de la función está en el evento ascendente, y hay un mecanismo disponible para abortar la función antes de la finalización o para deshacer la función después de la finalización.</li><li><strong>Reversión hacia arriba (Up Reversal)</strong>: el evento hacia arriba invierte cualquier resultado del evento hacia abajo anterior.</li><li><strong>Esencial</strong>: Completar la función en el evento down es esencial.</li></ul></div><p>La intención de este criterio es facilitar a los usuarios la prevención de entradas de puntero accidentales o erróneas. Las personas con diversas discapacidades pueden iniciar sin darse cuenta eventos táctiles o del ratón con resultados no deseados. Cada una de las siguientes subsecciones detalla los puntos de la anterior lista y describe un medio para permitir a los usuarios cancelar las operaciones del puntero.</p><h3 class='fw-extrabold line-after mt-3 fs-4'>Activar o finalizar de un evento ascendente (Up-Event).</h3><p>La forma más accesible de incorporar la cancelación de puntero es hacer que la activación ocurra en el evento ascendente. Los autores cumplen con el primer punto usando solo el evento ascendente.</p><p><strong>La activación de eventos ascendentes se refiere a la activación de un objetivo cuando se suelta el puntero.</strong> En una interacción de pantalla táctil, cuando el dedo toca un objetivo, la activación del evento ascendente solo ocurre cuando el dedo se levanta mientras aún se encuentra dentro de los límites del objetivo. De manera similar, en la interacción del ratón, el evento ascendente ocurre cuando se suelta el botón del ratón mientras el cursor aún está dentro del límite del objetivo inicial establecido cuando se presionó el botón del ratón. Por ejemplo, el evento click en JavaScript se activa al soltar el botón principal del mouse y es un ejemplo de un evento ascendente implícito. A pesar de su nombre, el evento click es independiente del dispositivo y también funciona para interacción táctil y de teclado.</p><h3 class='fw-extrabold line-after mt-3 fs-4'>Abortar o deshacer un evento ascendente (Up-Event).</h3>Cuando la interacción es equivalente a un simple 'clic', la activación del evento ascendente tiene una capacidad incorporada para cancelar. Hay una distinción entre cuando alguien toca una pantalla y cuando quita el dedo. De manera similar, en la interacción con el ratón, existe una diferencia entre presionar y soltar el botón del ratón. Cuando la activación ocurre solo cuando se suelta el puntero, los usuarios tienen la oportunidad de Abortar (cancelar) la activación. Los usuarios que tienen dificultades para usar con precisión un ratón o una pantalla táctil se benefician enormemente de este comportamiento básico.</p><p>Para interacciones más complejas, como arrastrar y soltar, los eventos de subida y bajada pueden iniciar y finalizar una serie de acciones para completar un proceso. Por ejemplo, con arrastrar y soltar, el elemento puede ser:</p><ol><li>seleccionado con una pulsación (evento descendente),</li><li>se cambió a una nueva ubicación, mientras todavía estaba presionado, y</li><li>liberado (evento ascendente) para concluir la acción de soltar.</li></ol><p>En una acción tan compleja, aumenta la necesidad de una función Abortar o Deshacer. Los diseñadores pueden optar por confirmar el movimiento a través de algo como un cuadro de diálogo de confirmación o un botón de deshacer, lo que le da al usuario la capacidad de deshacer el proceso que acaba de completar.</p><h3 class='fw-extrabold line-after mt-3 fs-4'>Reversión hacia arriba.</h3>En otras interacciones, el evento negativo puede desencadenar un comportamiento que puede revertirse cuando concluye el evento positivo. Ejemplos de esto incluyen acciones de mantener presionado, como cuando aparece una ventana emergente transitoria (o se reproduce un video) cuando el usuario presiona un objeto (evento inactivo), pero la ventana emergente (o video) desaparece tan pronto como el usuario suelta el puntero (up-event). Dado que el evento ascendente invierte el evento descendente anterior, el usuario vuelve a su punto anterior y cancela efectivamente la operación.</p><h3 class='fw-extrabold line-after mt-3 fs-4'>Evento descendiente (Down-Event)</h3><p>Solo se permite completar la función en el evento descendente cuando es esencial que no se utilice el evento ascendente.</p><p>La activación esencial de eventos descendientes más prevalente ocurre en la emulación de teclado. En un teclado físico, las teclas se activan de forma predeterminada en el evento pulsación: aparece una letra cuando se presiona la tecla. Si un emulador de teclado de software intentara anular este comportamiento esperado haciendo que aparezcan letras cuando se suelta la tecla, el comportamiento sería inesperado y afectaría negativamente la interacción esperada.</p><p>Tenga en cuenta que un teclado tiene un botón incorporado de Retroceso o Eliminar, que proporciona efectivamente una opción de Deshacer. Deshacer no es un requisito de la excepción Esencial de evento inactivo; sin embargo, proporcionar una manera fácil para que los usuarios deshagan cualquier acción es una práctica recomendada (y puede ser una necesidad funcional), incluso cuando no sea un requisito de este Criterio de Conformidad.</p>"
}
