{
  "key": "Criterio de Conformidad 3.3.4",
  "name": "Prevención de errores (legales, financieros, datos)",
  "slug": "prevencion-errores",
  "level": "Nivel AA",
  "comment": "",
  "description": "<div class='objective'><p><strong>Para las páginas web que representan para el usuario compromisos legales o transacciones financieras</strong>; que modifican o eliminan datos controlables por el usuario en sistemas de almacenamiento de datos; o que envían las respuestas del usuario a una prueba, se cumple al menos uno de los siguientes casos.</p><ul><li><strong>Reversible</strong>: El envío es reversible.</li><li><strong>Revisado</strong>: Se verifica la información para detectar errores en la entrada de datos y se proporciona al usuario una oportunidad de corregirlos.</li><li><strong>Confirmado</strong>: Se proporciona un mecanismo para revisar, confirmar y corregir la información antes de finalizar el envío de los datos.</li></ul></div><p>La intención de este criterio es ayudar a los usuarios con discapacidad a evitar consecuencias graves como resultado de un error al realizar una acción que no se puede revertir. Por ejemplo, comprar boletos de avión no reembolsables o enviar una orden para comprar acciones son transacciones financieras con graves consecuencias que tienen lugar de inmediato y no se pueden modificar después, o puede ser muy costoso.</p><p>Cuando se hace referencia a la modificación o eliminación de datos 'controlables por el usuario’ la intención es evitar la pérdida de datos involuntariamente. No es la intención solicitar una confirmación para cada comando de guardado o la simple creación o edición de documentos, registros u otros datos.</p><p>Brindar la capacidad de revertir acciones permite a los usuarios corregir un error que podría tener consecuencias graves. Brindar la capacidad de revisar y corregir la información brinda al usuario la oportunidad de detectar un error antes de tomar una acción que tenga consecuencias graves.</p><p>Los datos controlables por el usuario son datos visibles por el usuario que el usuario puede cambiar y/o eliminar a través de una acción intencional. No se refiere a cosas como registros de Internet y datos de monitoreo de motores de búsqueda que el usuario no puede ver o con los que interactuar directamente.</p>",
  "examples": [
    {
      "title": "Confirmación de pedidos en comercios electrónicos.",
      "description": "<p>Un minorista web ofrece compras en línea para los clientes. Cuando se envía un pedido, se muestra la información del pedido, incluidos los artículos pedidos, la cantidad de cada artículo pedido, la dirección de envío y el método de pago, para que el usuario pueda inspeccionar el pedido para ver si es correcto. El usuario puede confirmar el pedido o realizar cambios.</p>"
    }
  ]
}
