{
  "key": "Criterio de Conformidad 3.3.1",
  "name": "Identificación de errores",
  "slug": "identificacion-errores",
  "level": "Nivel A",
  "comment": "",
  "description": "<p class='objective'><strong>Si se detecta automáticamente un error en la entrada de datos, el elemento erróneo es identificado y el error se describe al usuario mediante un texto.</strong></p><p>La intención de este criterio es garantizar que los usuarios sepan que se ha producido un error y puedan determinar cuál es el problema. <strong>El mensaje de error debe ser lo más específico posible.</strong> <strong>Este criterio no significa que el color o los estilos de texto no puedan usarse para indicar errores, simplemente requiere que los errores también se identifiquen mediante texto.</strong></p><p>En el caso de un envío fallido del formulario, volver a mostrar el formulario e indicar los campos erróneos es insuficiente para que algunos usuarios perciban que se ha producido un error. Los usuarios de lectores de pantalla, por ejemplo, no sabrán que hubo un error hasta que encuentren uno de los indicadores, pudiendo abandonar el formulario por completo antes de encontrar el indicador de error, pensando que la página simplemente no funciona.</p><p>Un error de entrada es información proporcionada por el usuario que no se acepta. Esto incluye:</p><ul><li>Información que es requerida por la página web, pero omitida por el usuario.</li><li>Información proporcionada por el usuario pero que se encuentra fuera del formato de datos requerido o valores permitidos.</li></ul><p>La identificación y descripción de un error se puede combinar con información programática que los agentes de usuario o las tecnologías de asistencia pueden usar para identificar un error y proporcionar información de error al usuario. Es perfectamente aceptable indicar el error de otras formas, como imagen, color, etc., además de la descripción del texto.</p><p><em>Nota</em>: Si un usuario ingresa un valor que es demasiado alto o bajo, y la codificación en la página cambia automáticamente ese valor para que esté dentro del rango permitido, el error del usuario aún deberá describirse según lo requiera el criterio de éxito. Una descripción de error de este tipo que informe a la persona del valor modificado cumpliría tanto con este criterio de éxito (3.3.1 Identificación de error) como con el criterio <a href='#sugerencias-errores'>3.3.3 Sugerencia de errores</a>.</p>",
  "examples": [
    {
      "title": "Envíos de formularios incompletos o con campos no válidos.",
      "description": "<p>Cuando un usuario realiza un envío de un formulario que contiene campos vacíos que son obligatorios se muestra una notificación que avisa que hay campos obligatorios que no han sido rellenados, además de bordear y resaltar en rojo los campos afectados. Cuando un valor introducido no sea válido con el valor esperado, además de la notificación, junto a los campos afectados se proporciona un texto descriptivo del valor esperado.</p>"
    }
  ]
}
