{
  "key": "Criterio de Conformidad 2.2.1",
  "name": "Tiempo ajustable",
  "slug": "tiempo-ajustable",
  "level": "Nivel A",
  "comment": "",
  "description": "<div class='objective'><p><strong>Se cumple al menos uno de los siguientes casos para cada límite de tiempo impuesto por el contenido:</strong></p><ul><li><strong>Apagar</strong>: El usuario puede detener el límite de tiempo antes de alcanzar el límite de tiempo.</li><li><strong>Ajustar</strong>: El usuario puede ajustar el límite de tiempo antes de alcanzar dicho límite en un rango amplio que es, al menos, diez veces mayor al tiempo fijado originalmente.</li><li><strong>Extender</strong>: Se advierte al usuario antes de que el tiempo expire y se le conceden al menos 20 segundos para extender el límite temporal con una acción simple (por ejemplo, 'presione la barra de espacio') y el usuario puede extender ese límite de tiempo al menos diez veces.</li><li><strong>Excepción de tiempo real</strong>: El límite de tiempo es un requisito que forma parte de un evento en tiempo real (por ejemplo, una subasta) y no resulta posible ofrecer una alternativa al límite de tiempo.</li><li><strong>Excepción por ser esencial</strong>: El límite de tiempo es esencial y, si se extendiera, invalidaría la actividad.</li><li><strong>Excepción de 20 horas</strong>: El límite de tiempo es mayor a 20 horas.</li></ul></div><p><em>Nota</em>: Este criterio de conformidad ayuda a asegurarse de que los usuarios puedan completar una tarea sin cambios inesperados en el contenido o contexto que sean el resultado de un límite de tiempo. Este criterio de conformidad debe considerarse en combinación con el <a href='/normas-de-accesibilidad-web/entendible/predecible#recibir-el-foco'>Criterio de Conformidad 3.2.1</a>, que impone límites a los cambios de contenido o contexto como resultado de una acción del usuario.</p><p>La intención de este criterio es garantizar que los usuarios con discapacidades tengan el tiempo adecuado para interactuar con el contenido web siempre que sea posible. Las personas con discapacidades como ceguera, baja visión, problemas de destreza y limitaciones cognitivas pueden necesitar más tiempo para leer el contenido o realizar funciones como completar formularios en línea. Si las funciones web dependen del tiempo, será difícil para algunos usuarios realizar la acción requerida antes de que se cumpla un límite de tiempo. Esto puede hacer que el servicio sea inaccesible para ellos. Diseñar funciones que no dependan del tiempo ayudará a las personas con discapacidades a tener éxito en completar estas funciones. Proporcionar opciones para deshabilitar los límites de tiempo, personalizar la duración de los límites de tiempo, o solicitar más tiempo antes de que se alcance un límite de tiempo ayuda a aquellos usuarios que requieren más tiempo del esperado para completar las tareas con éxito. Estas opciones se enumeran en el orden en que serán más útiles para el usuario. Deshabilitar los límites de tiempo es mejor que personalizar la duración de los límites de tiempo, que es mejor que solicitar más tiempo antes de que se produzca un límite de tiempo.</p><p>Esto incluye cualquier proceso que ocurra sin la iniciación del usuario después de un tiempo establecido o de forma periódica es un límite de tiempo: actualizaciones parciales o completas de contenido (por ejemplo, actualización de página), cambios en el contenido o la expiración de una ventana de oportunidad para que un usuario reaccione a una solicitud de entrada.</p><p>También incluye contenido que avanza o se actualiza a un ritmo que supera la capacidad del usuario para leerlo o comprenderlo. En otras palabras, el contenido animado, en movimiento o desplazable introduce un límite de tiempo en la capacidad de los usuarios para leer el contenido.</p>"
}
