{
  "key": "Criterio de Conformidad 2.2.2",
  "name": "Poner en pausa, detener, ocultar",
  "slug": "pausa-detener-ocultar",
  "level": "Nivel A",
  "comment": "",
  "description": "<div class='objective'><p><strong>Para la información que tiene movimiento, parpadeo, se desplaza o se actualiza automáticamente, se cumplen todos los casos siguientes:</strong></p><ul><li><strong>Movimiento, parpadeo, desplazamiento</strong>: Para toda información que se mueve, parpadea o se desplaza, que (1) comienza automáticamente, (2) dura más de cinco segundos y (3) se presenta en paralelo con otro contenido, existe un mecanismo para que el usuario la pueda poner en pausa, detener u ocultar, a menos que el movimiento, parpadeo o desplazamiento sea parte esencial de una actividad; y</li><li><strong>Actualización automática</strong>: Para toda información que se actualiza automáticamente, que (1) se inicia automáticamente y (2) se presenta en paralelo con otro contenido, existe un mecanismo para que el usuario la pueda poner en pausa, detener u ocultar, o controlar la frecuencia de actualización a menos que la actualización automática sea parte esencial de una actividad.</li></ul></div><div><p><em>Nota 1</em>: Para los requisitos relacionados con el parpadeo o el destello de contenido, véase la <a href='/normas-de-accesibilidad-web/operable/convulsiones'>Pauta 2.3</a>.</p><p><em>Nota 2</em>: En la medida en que cualquier contenido que no satisfaga este criterio puede interferir con la capacidad del usuario para emplear la página como un todo, todo contenido de la página web (tanto si satisface o no otros criterios de conformidad) debe satisfacer este criterio.</p><p><em>Nota 3</em>: Para el contenido que es actualizado periódicamente por medio de un software, o que se sirve a la aplicación de usuario por medio de streaming, no hay obligación de preservar o presentar la información que ha sido generada o recibida entre el inicio de la pausa y el reinicio de la presentación; no sólo podría no ser técnicamente posible, sino que además en muchas ocasiones podría ser erróneo o engañoso hacerlo.</p><p><em>Nota 4</em>: Una animación que ocurre como parte de una fase de precarga de un contenido o una situación similar puede ser considerada esencial si no se permite interacción a ningún usuario durante esa fase, y si el hecho de no indicar el progreso pudiera confundir a los usuarios y hacerles creer que ha habido un fallo en el contenido.</p><p>La intención de este criterio es evitar distraer a los usuarios durante su interacción con una página web. El contenido que se mueve o se actualiza automáticamente puede ser una barrera para cualquier persona que tenga problemas para leer rápidamente un texto fijo, así como para cualquier persona que tenga problemas para rastrear objetos en movimiento. También puede causar problemas a los lectores de pantalla. Mover contenido también puede ser una gran distracción para algunas personas. Ciertos grupos, particularmente aquellos con trastornos de déficit de atención, encuentran que el contenido parpadeante los distrae, lo que les dificulta concentrarse en otras partes de la página web. Se eligieron cinco segundos porque es suficiente para llamar la atención del usuario, pero no tanto como para que el usuario no pueda esperar a que pase la distracción si es necesario para usar la página.</p>",
  "examples": [
    {
      "title": "Una animación esencial se puede pausar sin afectar la actividad.",
      "description": "<p>Un sitio web ayuda a los usuarios a entender 'cómo funcionan las cosas' a través de animaciones que muestran los procesos. Las animaciones tienen botones de 'pausa' y 'reinicio'.</p>"
    }
  ]
}
